app/controllers/account_activations_controller.rb

	def edit
		user = User.find_by(email: params[:email])
		if user && !user.activated? &&  user.authenticated?(:activation, params[:id])
			user.update_attribute(:activated, true)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "vzradha@gmail.com"]]
UPDATE "users" SET "activated_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["activated_at", "2015-09-02 11:32:01.845071"], ["updated_at", "2015-09-02 11:32:01.845730"], ["id", 101]]