app/controllers/microposts_controller.rb

	def create
		@micropost = current_user.microposts.build(micropost_params)
		if @micropost.save
---
INSERT INTO "microposts" ("content", "picture", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "test4"], ["picture", "image1.JPG"], ["user_id", 1], ["created_at", "2015-10-21 03:42:49.425822"], ["updated_at", "2015-10-21 03:42:49.425822"]]